Ale-maker325/ESP32_CRSF_v000/src/CRSF_ESP32.h
//////////////////////////////////////////////////////////////





/* CRC8 implementation with polynom = x​7​+ x​6​+ x​4​+ x​2​+ x​0 ​(0xD5) */
static unsigned char crc8tab[256] = {
    0x00, 0xD5, 0x7F, 0xAA, 0xFE, 0x2B, 0x81, 0x54, 0x29, 0xFC, 0x56, 0x83, 0xD7, 0x02, 0xA8, 0x7D,
    0x52, 0x87, 0x2D, 0xF8, 0xAC, 0x79, 0xD3, 0x06, 0x7B, 0xAE, 0x04, 0xD1, 0x85, 0x50, 0xFA, 0x2F,
    0xA4, 0x71, 0xDB, 0x0E, 0x5A, 0x8F, 0x25, 0xF0, 0x8D, 0x58, 0xF2, 0x27, 0x73, 0xA6, 0x0C, 0xD9,
    0xF6, 0x23, 0x89, 0x5C, 0x08, 0xDD, 0x77, 0xA2, 0xDF, 0x0A, 0xA0, 0x75, 0x21, 0xF4, 0x5E, 0x8B,
    0x9D, 0x48, 0xE2, 0x37, 0x63, 0xB6, 0x1C, 0xC9, 0xB4, 0x61, 0xCB, 0x1E, 0x4A, 0x9F, 0x35, 0xE0,
    0xCF, 0x1A, 0xB0, 0x65, 0x31, 0xE4, 0x4E, 0x9B, 0xE6, 0x33, 0x99, 0x4C, 0x18, 0xCD, 0x67, 0xB2,
    0x39, 0xEC, 0x46, 0x93, 0xC7, 0x12, 0xB8, 0x6D, 0x10, 0xC5, 0x6F, 0xBA, 0xEE, 0x3B, 0x91, 0x44,
    0x6B, 0xBE, 0x14, 0xC1, 0x95, 0x40, 0xEA, 0x3F, 0x42, 0x97, 0x3D, 0xE8, 0xBC, 0x69, 0xC3, 0x16,
    0xEF, 0x3A, 0x90, 0x45, 0x11, 0xC4, 0x6E, 0xBB, 0xC6, 0x13, 0xB9, 0x6C, 0x38, 0xED, 0x47, 0x92,
    0xBD, 0x68, 0xC2, 0x17, 0x43, 0x96, 0x3C, 0xE9, 0x94, 0x41, 0xEB, 0x3E, 0x6A, 0xBF, 0x15, 0xC0,
    0x4B, 0x9E, 0x34, 0xE1, 0xB5, 0x60, 0xCA, 0x1F, 0x62, 0xB7, 0x1D, 0xC8, 0x9C, 0x49, 0xE3, 0x36,
    0x19, 0xCC, 0x66, 0xB3, 0xE7, 0x32, 0x98, 0x4D, 0x30, 0xE5, 0x4F, 0x9A, 0xCE, 0x1B, 0xB1, 0x64,
    0x72, 0xA7, 0x0D, 0xD8, 0x8C, 0x59, 0xF3, 0x26, 0x5B, 0x8E, 0x24, 0xF1, 0xA5, 0x70, 0xDA, 0x0F,
    0x20, 0xF5, 0x5F, 0x8A, 0xDE, 0x0B, 0xA1, 0x74, 0x09, 0xDC, 0x76, 0xA3, 0xF7, 0x22, 0x88, 0x5D,
    0xD6, 0x03, 0xA9, 0x7C, 0x28, 0xFD, 0x57, 0x82, 0xFF, 0x2A, 0x80, 0x55, 0x01, 0xD4, 0x7E, 0xAB,
    0x84, 0x51, 0xFB, 0x2E, 0x7A, 0xAF, 0x05, 0xD0, 0xAD, 0x78, 0xD2, 0x07, 0x53, 0x86, 0x2C, 0xF9
};






















































////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////        ЭТО СТАРАЯ БИБЛИОТЕКА    ///////////////////////////////////////

static inline uint16_t ICACHE_RAM_ATTR UINT_to_CRSF(uint16_t Val);

static inline uint8_t ICACHE_RAM_ATTR CalcCRC(volatile uint8_t *data, int length);
static inline uint8_t ICACHE_RAM_ATTR CalcCRC(uint8_t *data, int length);

uint8_t ICACHE_RAM_ATTR CalcCRC(volatile uint8_t *data, int length)
{
    uint8_t crc = 0;
    for (uint8_t i = 0; i < length; i++)
    {
        crc = crc8tab[crc ^ *data++];
    }
    return crc;
}

uint8_t ICACHE_RAM_ATTR CalcCRC(uint8_t *data, int length)
{
    uint8_t crc = 0;
    for (uint8_t i = 0; i < length; i++)
    {
        crc = crc8tab[crc ^ *data++];
    }
    return crc;
}


/////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////
















class CRSF
{

public:


#ifdef PLATFORM_ESP8266
    //CRSF(HardwareSerial& serial);
    CRSF(Stream *dev) : _dev(dev) {}
    CRSF(Stream &dev) : _dev(&dev) {}

    void InitSerial()
    {
        _dev->println("I am ready");
    }

#endif

//#ifdef CRSF_TX_MODULE     //это в основной библиотеке
    static HardwareSerial Port;
    static Stream *PortSecondary; //Это из основной библиотеки,,, A second UART used to mirror telemetry out on the TX, not read from

    static volatile uint16_t ChannelDataIn[16];
    static volatile uint16_t ChannelDataInPrev[16]; // Contains the previous RC channel data
    static volatile uint16_t ChannelDataOut[16];

    static void (*RCdataCallback1)(); //function pointer for new RC data callback
    static void (*RCdataCallback2)(); //function pointer for new RC data callback

    static void (*disconnected)();
    static void (*connected)();
    static void (*RecvModelUpdate)();   //это добавлено из бибилиотеки
    
    /////////////////////////////////////////////////////////////////////////////////////////////////////////////

    //это добавлено из библиотеки
    //static void (*RecvParameterUpdate)(uint8_t type, uint8_t index, uint8_t arg);
    //это было старая запись
    static void (*RecvParameterUpdate)(); 
    
    /////////////////////////////////////////////////////////////////////////////////////////////////////////////



    //это добавлено из библиотеки
    static void (*RCdataCallback)();

    // The model ID as received from the Transmitter
    //эти три строки добавлены из библиотеки
    static uint8_t modelId;
    static bool ForwardDevicePings; // true if device pings should be forwarded OTA
    static bool elrsLUAmode;

    /// UART Handling ///
    //эти две строки добавлены из библиотеки
    static uint32_t GoodPktsCountResult; // need to latch the results
    static uint32_t BadPktsCountResult; // need to latch the results
//#endif


    static volatile crsfPayloadLinkstatistics_s LinkStatistics; // Link Statisitics Stored as Struct
    
    static void Begin(); //setup timers etc
    static void End(); //stop timers etc //добавлено из библиотеки


    ///////////////////////////////////////////////////////////
    //все 5 добавлены из библиотеки
    static void GetDeviceInformation(uint8_t *frame, uint8_t fieldCount);
    static void SetMspV2Request(uint8_t *frame, uint16_t function, uint8_t *payload, uint8_t payloadLength);
    static void SetHeaderAndCrc(uint8_t *frame, uint8_t frameType, uint8_t frameSize, uint8_t destAddr);
    static void SetExtendedHeaderAndCrc(uint8_t *frame, uint8_t frameType, uint8_t frameSize, uint8_t senderAddr, uint8_t destAddr);
    static uint32_t VersionStrToU32(const char *verStr);
    ///////////////////////////////////////////////////////////

//#ifdef CRSF_TX_MODULE
    //////////////////////////////////
    //Добавлено из новой библиотеки все три
    static bool IsArmed() { return CRSF_to_BIT(ChannelData[4]); } // AUX1
    static void ICACHE_RAM_ATTR sendLinkStatisticsToTX();
    static void ICACHE_RAM_ATTR sendTelemetryToTX(uint8_t *data);
    //////////////////////////////////

    void ICACHE_RAM_ATTR sendLinkStatisticsToFC();      //было в старой библиотеке
    //void ICACHE_RAM_ATTR sendLinkStatisticsToTX();    //было в старой, но чуть выше повтор из новой


    static void packetQueueExtended(uint8_t type, void *data, uint8_t len);



    
