Ale-maker325/ESP32_CRSF_v000/src/CRSF_ESP32.h
    ///////// Variables for OpenTX Syncing //////////////////////////
    //раздел добавлен из новой библиотеки, однако ему требуются
    //дополнительные параметры - файл "msp.h"   !!!!!!!!!!!
    // #define OpenTXsyncPacketInterval 200 // in ms
    // static void ICACHE_RAM_ATTR setSyncParams(int32_t PacketInterval);
    // static void ICACHE_RAM_ATTR JustSentRFpacket();
    // static void ICACHE_RAM_ATTR sendSyncPacketToTX();
    // static void disableOpentxSync();
    // static void enableOpentxSync();

    // static void handleUARTin();

    // static uint8_t getModelID() { return modelId; }

    // static void GetMspMessage(uint8_t **data, uint8_t *len);
    // static void UnlockMspMessage();
    // static void AddMspMessage(const uint8_t length, uint8_t* data);
    // static void AddMspMessage(mspPacket_t* packet);
    // static void ResetMspQueue();
    // static uint32_t OpenTXsyncLastSent;
    // static uint8_t GetMaxPacketBytes() { return maxPacketBytes; }
    // static uint32_t GetCurrentBaudRate() { return UARTrequestedBaud; }

    // static uint32_t ICACHE_RAM_ATTR GetRCdataLastRecv();
    // static void ICACHE_RAM_ATTR RcPacketToChannelsData();
///////////////////////////////////////////////
/////////////////////////////////////////////////

//#endif


    static bool CRSFstate;


    static volatile uint8_t ParameterUpdateData[2];
    static bool firstboot;
    static bool CRSFstatePrev;
    static uint8_t CSFR_TXpin_Module;
    static uint8_t CSFR_RXpin_Module;
    static uint8_t CSFR_TXpin_Recv;
    static uint8_t CSFR_RXpin_Recv;

    /////Variables/////

    static volatile crsf_channels_s PackedRCdataOut;            // RC data in packed format for output.
  
    static void ICACHE_RAM_ATTR duplex_set_RX();
    static void ICACHE_RAM_ATTR duplex_set_TX();
    static void ICACHE_RAM_ATTR duplex_set_HIGHZ();
    static void ICACHE_RAM_ATTR FlushSerial();
    static void GetSYNC(); //SYNC to incomming data

#ifdef PLATFORM_ESP32
    static void ICACHE_RAM_ATTR ESP32uartTask(void *pvParameters);
#else
    static void ICACHE_RAM_ATTR ESP8266ReadUart();
#endif

    void ICACHE_RAM_ATTR sendRCFrameToFC();
    

    //static void BuildRCPacket(crsf_addr_e addr = CRSF_ADDRESS_FLIGHT_CONTROLLER); //build packet to send to the FC

    static void ICACHE_RAM_ATTR SerialISR();
    static void ICACHE_RAM_ATTR ProcessPacket();
    static void ICACHE_RAM_ATTR GetChannelDataIn();

    static void inline nullCallback(void);

    //static uint16_t ICACHE_RAM_ATTR CRSF_to_US(uint16_t Datain) { return (0.62477120195241f * Datain) + 881; };

private:
    Stream *_dev;

    static inBuffer_U inBuffer;     //добавлено из новой библиотеки


//#if CRSF_TX_MODULE
    /// UART Handling ///
    static volatile uint8_t SerialInPacketLen;   // length of the CRSF packet as measured
    static volatile uint8_t SerialInPacketPtr;   // index where we are reading/writing
    static volatile bool CRSFframeActive;  //since we get a copy of the serial data use this flag to know when to ignore it
    
    ///всё добавлено из новой библиотеки
    ////////////////////////////////////////////////
    static uint32_t GoodPktsCount;
    static uint32_t BadPktsCount;
    static uint32_t UARTwdtLastChecked;
    static uint8_t maxPacketBytes;
    static uint8_t maxPeriodBytes;
    static uint32_t TxToHandsetBauds[7];
    static uint8_t UARTcurrentBaudIdx;
    static uint32_t UARTrequestedBaud;
    static uint8_t MspData[ELRS_MSP_BUFFER];
    static uint8_t MspDataLength;
    //#if defined(PLATFORM_ESP32)
        static bool UARTinverted;
    //#endif
    static void ICACHE_RAM_ATTR adjustMaxPacketSize();
    //static void handleUARTout();
    static bool UARTwdt();
    static uint32_t autobaud();
    static void flush_port_input(void);
    
    //конец добавленного сектора
    //////////////////////////////////////////////
    /////////////////////////////////////////////
    
    
    static volatile uint8_t SerialInBuffer[100]; // max 64 bytes for CRSF packet serial buffer
    static volatile uint8_t CRSFoutBuffer[CRSF_MAX_PACKET_LEN + 1]; //index 0 hold the length of the datapacket
    static volatile bool ignoreSerialData; //since we get a copy of the serial data use this flag to know when to ignore it

//#endif

};

//float fmap(float x, float in_min, float in_max, float out_min, float out_max);

extern GENERIC_CRC8 crsf_crc;

#endif